In [ ]:
# Pandas SQL

In [ ]:
#pip install pandasql

In [ ]:
import pandas as pd
from pandasql import sqldf
import os

In [ ]:
projectFolder ='/Users/du/dup/analytics/projects/piit/data/'
os.listdir(projectFolder)

In [ ]:
file_path = projectFolder + "sqlpractise1.xlsx"
employees_df = pd.read_excel(file_path, sheet_name="Employees")
departments_df = pd.read_excel(file_path, sheet_name="Departments")

In [10]:
employees_df

   emp_id first_name last_name  dept_id  salary  is_active
0       1      Alice     Smith      101   50000          1
1       2        Bob     Jones      102   60000          1
2       3    Charlie     Brown      101   55000          0
3       4      David    Wilson      103   70000          1
4       5        Eva    Taylor      102   65000          1

In [11]:
departments_df

   dept_id    dept_name  manager_id
0      101           HR           1
1      102  Engineering           2
2      103    Marketing           4

In [12]:
# Define SQL query function
pysqldf = lambda q: sqldf(q, globals())

## Select All Employees

In [13]:
pysqldf("SELECT * FROM employees_df;")

   emp_id first_name last_name  dept_id  salary  is_active
0       1      Alice     Smith      101   50000          1
1       2        Bob     Jones      102   60000          1
2       3    Charlie     Brown      101   55000          0
3       4      David    Wilson      103   70000          1
4       5        Eva    Taylor      102   65000          1

## Employees with salary > 55000

In [ ]:
pysqldf("SELECT * FROM employees_df WHERE salary > 55000;")

## Join Employees and Departments

In [ ]:
pysqldf("""
    SELECT e.first_name, e.last_name, d.dept_name
    FROM employees_df e
    JOIN departments_df d ON e.dept_id = d.dept_id;
""")

## Count Employees Per Department

In [ ]:
pysqldf("""
    SELECT d.dept_name, COUNT(e.emp_id) AS employee_count
    FROM employees_df e
    JOIN departments_df d ON e.dept_id = d.dept_id
    GROUP BY d.dept_name;
""")

## Inactive Employees

In [ ]:
pysqldf("SELECT * FROM employees_df WHERE is_active = 0;")

# DML Commands 
- limited features in pandasql